google-coral/coralmicro-rt1176-sdk/middleware/wiced/43xxx_Wi-Fi/WICED/platform/MCU/PSoC6/peripherals/libraries/drivers/peripheral/sdio/SDIO_HOST_CMD_DMA.h
/*******************************************************************************
* File Name: SDIO_HOST_CMD_DMA.h
* Version 2.0
*
* Description:
*  This file provides constants, parameter values and API definition for the
*  SDIO_HOST_CMD_DMA Component.
*
********************************************************************************
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(SDIO_HOST_CMD_DMA_CH_H)
#define SDIO_HOST_CMD_DMA_CH_H

#include "cy_device_headers.h"
#include "cyfitter.h"
#include "dma/cy_dma.h"
#include "trigmux/cy_trigmux.h"

#if defined(__cplusplus)
extern "C" {
#endif

#define SDIO_HOST_CMD_DMA_DW_BLOCK       (0u)
#define SDIO_HOST_CMD_DMA_DW_CHANNEL     (1u)
#define SDIO_HOST_CMD_DMA_HW             (DW0)
#define SDIO_HOST_CMD_DMA_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define SDIO_HOST_CMD_DMA_PRIORITY       (1u)
#define SDIO_HOST_CMD_DMA_DESCRIPTOR_NUM (1u)
#define SDIO_HOST_CMD_DMA_PREEMPTABLE    (true)

/***************************************
*        Function Prototypes
***************************************/

                void SDIO_HOST_CMD_DMA_Start(void const * srcAddress, void const * dstAddress);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_Stop(void);
                void SDIO_HOST_CMD_DMA_Init(void);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_ChannelEnable(void);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_ChannelDisable(void);

__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetDescriptor       (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetNextDescriptor   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetPriority         (uint32_t priority);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetSrcAddress       (cy_stc_dma_descriptor_t * descriptor, void const * srcAddress);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetDstAddress       (cy_stc_dma_descriptor_t * descriptor, void const * dstAddress);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetXloopDataCount   (cy_stc_dma_descriptor_t * descriptor, uint32_t xCount);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetYloopDataCount   (cy_stc_dma_descriptor_t * descriptor, uint32_t yCount);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetXloopSrcIncrement(cy_stc_dma_descriptor_t * descriptor, int32_t srcXincrement);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetXloopDstIncrement(cy_stc_dma_descriptor_t * descriptor, int32_t dstXincrement);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetYloopSrcIncrement(cy_stc_dma_descriptor_t * descriptor, int32_t srcYincrement);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetYloopDstIncrement(cy_stc_dma_descriptor_t * descriptor, int32_t dstYincrement);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetInterruptType    (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_trigger_type_t interruptType);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetTriggerInType    (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_trigger_type_t triggerInType);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetTriggerOutType   (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_trigger_type_t triggerOutType);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetDataSize         (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_data_size_t dataSize);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetSrcTransferSize  (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_transfer_size_t srcTransferSize);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetDstTransferSize  (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_transfer_size_t dstTransferSize);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetRetrigger        (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_retrigger_t retrigger);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetDescriptorType   (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_descriptor_type_t descriptorType);
__STATIC_INLINE void SDIO_HOST_CMD_DMA_SetChannelState     (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_channel_state_t channelState);

__STATIC_INLINE cy_stc_dma_descriptor_t *   SDIO_HOST_CMD_DMA_GetDescriptor(void);
__STATIC_INLINE cy_stc_dma_descriptor_t *   SDIO_HOST_CMD_DMA_GetNextDescriptor(void);
__STATIC_INLINE uint32_t                    SDIO_HOST_CMD_DMA_GetPriority(void);
__STATIC_INLINE cy_en_dma_intr_cause_t      SDIO_HOST_CMD_DMA_GetStatus(void);
__STATIC_INLINE cy_en_trigmux_status_t      SDIO_HOST_CMD_DMA_Trigger(uint32_t cycles);
__STATIC_INLINE void *                      SDIO_HOST_CMD_DMA_GetSrcAddress       (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE void *                      SDIO_HOST_CMD_DMA_GetDstAddress       (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE uint32_t                    SDIO_HOST_CMD_DMA_GetXloopDataCount   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE uint32_t                    SDIO_HOST_CMD_DMA_GetYloopDataCount   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE int32_t                     SDIO_HOST_CMD_DMA_GetXloopSrcIncrement(cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE int32_t                     SDIO_HOST_CMD_DMA_GetXloopDstIncrement(cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE int32_t                     SDIO_HOST_CMD_DMA_GetYloopSrcIncrement(cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE int32_t                     SDIO_HOST_CMD_DMA_GetYloopDstIncrement(cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_trigger_type_t    SDIO_HOST_CMD_DMA_GetInterruptType    (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_trigger_type_t    SDIO_HOST_CMD_DMA_GetTriggerInType    (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_trigger_type_t    SDIO_HOST_CMD_DMA_GetTriggerOutType   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_data_size_t       SDIO_HOST_CMD_DMA_GetDataSize         (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_transfer_size_t   SDIO_HOST_CMD_DMA_GetSrcTransferSize  (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_transfer_size_t   SDIO_HOST_CMD_DMA_GetDstTransferSize  (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_retrigger_t       SDIO_HOST_CMD_DMA_GetRetrigger        (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_descriptor_type_t SDIO_HOST_CMD_DMA_GetDescriptorType   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_channel_state_t   SDIO_HOST_CMD_DMA_GetChannelState     (cy_stc_dma_descriptor_t const * descriptor);

__STATIC_INLINE uint32_t SDIO_HOST_CMD_DMA_GetInterruptStatus(void);
__STATIC_INLINE void     SDIO_HOST_CMD_DMA_ClearInterrupt(void);
__STATIC_INLINE void     SDIO_HOST_CMD_DMA_SetInterrupt(void);
__STATIC_INLINE uint32_t SDIO_HOST_CMD_DMA_GetInterruptMask(void);
__STATIC_INLINE void     SDIO_HOST_CMD_DMA_SetInterruptMask(uint32_t interrupt);
__STATIC_INLINE uint32_t SDIO_HOST_CMD_DMA_GetInterruptStatusMasked(void);


